Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/hmatrix2.h
/*
 * Component description for HMATRIX2
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-11-16T06:44:02Z */
#ifndef _PIC32CKSG01_HMATRIX2_COMPONENT_H_
#define _PIC32CKSG01_HMATRIX2_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR HMATRIX2                                     */
/* ************************************************************************** */

/* -------- HMATRIX2_PRAS : (HMATRIX2 Offset: 0x00) (R/W 32) Priority A for Slave -------- */
#define HMATRIX2_PRAS_RESETVALUE              _UINT32_(0x00)                                       /*  (HMATRIX2_PRAS) Priority A for Slave  Reset Value */

#define HMATRIX2_PRAS_M0PR_Pos                _UINT32_(0)                                          /* (HMATRIX2_PRAS) Master 0 Priority Position */
#define HMATRIX2_PRAS_M0PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M0PR_Pos)            /* (HMATRIX2_PRAS) Master 0 Priority Mask */
#define HMATRIX2_PRAS_M0PR(value)             (HMATRIX2_PRAS_M0PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M0PR_Pos)) /* Assigment of value for M0PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN0_Pos             _UINT32_(2)                                          /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 0 Position */
#define HMATRIX2_PRAS_LQOSEN0_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN0_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 0 Mask */
#define HMATRIX2_PRAS_LQOSEN0(value)          (HMATRIX2_PRAS_LQOSEN0_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN0_Pos)) /* Assigment of value for LQOSEN0 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_M1PR_Pos                _UINT32_(4)                                          /* (HMATRIX2_PRAS) Master 1 Priority Position */
#define HMATRIX2_PRAS_M1PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M1PR_Pos)            /* (HMATRIX2_PRAS) Master 1 Priority Mask */
#define HMATRIX2_PRAS_M1PR(value)             (HMATRIX2_PRAS_M1PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M1PR_Pos)) /* Assigment of value for M1PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN1_Pos             _UINT32_(6)                                          /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 1 Position */
#define HMATRIX2_PRAS_LQOSEN1_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN1_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 1 Mask */
#define HMATRIX2_PRAS_LQOSEN1(value)          (HMATRIX2_PRAS_LQOSEN1_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN1_Pos)) /* Assigment of value for LQOSEN1 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_M2PR_Pos                _UINT32_(8)                                          /* (HMATRIX2_PRAS) Master 2 Priority Position */
#define HMATRIX2_PRAS_M2PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M2PR_Pos)            /* (HMATRIX2_PRAS) Master 2 Priority Mask */
#define HMATRIX2_PRAS_M2PR(value)             (HMATRIX2_PRAS_M2PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M2PR_Pos)) /* Assigment of value for M2PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN2_Pos             _UINT32_(10)                                         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 2 Position */
#define HMATRIX2_PRAS_LQOSEN2_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN2_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 2 Mask */
#define HMATRIX2_PRAS_LQOSEN2(value)          (HMATRIX2_PRAS_LQOSEN2_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN2_Pos)) /* Assigment of value for LQOSEN2 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_M3PR_Pos                _UINT32_(12)                                         /* (HMATRIX2_PRAS) Master 3 Priority Position */
#define HMATRIX2_PRAS_M3PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M3PR_Pos)            /* (HMATRIX2_PRAS) Master 3 Priority Mask */
#define HMATRIX2_PRAS_M3PR(value)             (HMATRIX2_PRAS_M3PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M3PR_Pos)) /* Assigment of value for M3PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN3_Pos             _UINT32_(14)                                         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 3 Position */
#define HMATRIX2_PRAS_LQOSEN3_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN3_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 3 Mask */
#define HMATRIX2_PRAS_LQOSEN3(value)          (HMATRIX2_PRAS_LQOSEN3_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN3_Pos)) /* Assigment of value for LQOSEN3 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_M4PR_Pos                _UINT32_(16)                                         /* (HMATRIX2_PRAS) Master 4 Priority Position */
#define HMATRIX2_PRAS_M4PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M4PR_Pos)            /* (HMATRIX2_PRAS) Master 4 Priority Mask */
#define HMATRIX2_PRAS_M4PR(value)             (HMATRIX2_PRAS_M4PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M4PR_Pos)) /* Assigment of value for M4PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN4_Pos             _UINT32_(18)                                         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 4 Position */
#define HMATRIX2_PRAS_LQOSEN4_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN4_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 4 Mask */
#define HMATRIX2_PRAS_LQOSEN4(value)          (HMATRIX2_PRAS_LQOSEN4_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN4_Pos)) /* Assigment of value for LQOSEN4 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_M5PR_Pos                _UINT32_(20)                                         /* (HMATRIX2_PRAS) Master 5 Priority Position */
#define HMATRIX2_PRAS_M5PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M5PR_Pos)            /* (HMATRIX2_PRAS) Master 5 Priority Mask */
#define HMATRIX2_PRAS_M5PR(value)             (HMATRIX2_PRAS_M5PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M5PR_Pos)) /* Assigment of value for M5PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN5_Pos             _UINT32_(22)                                         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 5 Position */
#define HMATRIX2_PRAS_LQOSEN5_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN5_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 5 Mask */
#define HMATRIX2_PRAS_LQOSEN5(value)          (HMATRIX2_PRAS_LQOSEN5_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN5_Pos)) /* Assigment of value for LQOSEN5 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_M6PR_Pos                _UINT32_(24)                                         /* (HMATRIX2_PRAS) Master 6 Priority Position */
#define HMATRIX2_PRAS_M6PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M6PR_Pos)            /* (HMATRIX2_PRAS) Master 6 Priority Mask */
#define HMATRIX2_PRAS_M6PR(value)             (HMATRIX2_PRAS_M6PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M6PR_Pos)) /* Assigment of value for M6PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN6_Pos             _UINT32_(26)                                         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 6 Position */
#define HMATRIX2_PRAS_LQOSEN6_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN6_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 6 Mask */
#define HMATRIX2_PRAS_LQOSEN6(value)          (HMATRIX2_PRAS_LQOSEN6_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN6_Pos)) /* Assigment of value for LQOSEN6 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_M7PR_Pos                _UINT32_(28)                                         /* (HMATRIX2_PRAS) Master 7 Priority Position */
#define HMATRIX2_PRAS_M7PR_Msk                (_UINT32_(0x3) << HMATRIX2_PRAS_M7PR_Pos)            /* (HMATRIX2_PRAS) Master 7 Priority Mask */
#define HMATRIX2_PRAS_M7PR(value)             (HMATRIX2_PRAS_M7PR_Msk & (_UINT32_(value) << HMATRIX2_PRAS_M7PR_Pos)) /* Assigment of value for M7PR in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_LQOSEN7_Pos             _UINT32_(30)                                         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 7 Position */
#define HMATRIX2_PRAS_LQOSEN7_Msk             (_UINT32_(0x1) << HMATRIX2_PRAS_LQOSEN7_Pos)         /* (HMATRIX2_PRAS) Latency Quality Of Service Enable for Master 7 Mask */
#define HMATRIX2_PRAS_LQOSEN7(value)          (HMATRIX2_PRAS_LQOSEN7_Msk & (_UINT32_(value) << HMATRIX2_PRAS_LQOSEN7_Pos)) /* Assigment of value for LQOSEN7 in the HMATRIX2_PRAS register */
#define HMATRIX2_PRAS_Msk                     _UINT32_(0x77777777)                                 /* (HMATRIX2_PRAS) Register Mask  */


