Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/hmatrix2.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PRS register API structure */
typedef struct
{
  __IO  uint32_t                       HMATRIX2_PRAS;      /**< Offset: 0x00 (R/W  32) Priority A for Slave */
  __IO  uint32_t                       HMATRIX2_PRBS;      /**< Offset: 0x04 (R/W  32) Priority B for Slave */
} hmatrix2_prs_registers_t;

#define HMATRIX2_PRS_NUMBER 13

/** \brief HMATRIX2 register API structure */
typedef struct
{  /* HSB Matrix */
  __IO  uint32_t                       HMATRIX2_MCFG[16];  /**< Offset: 0x00 (R/W  32) Master Configuration */
  __IO  uint32_t                       HMATRIX2_SCFG[13];  /**< Offset: 0x40 (R/W  32) Slave Configuration */
  __I   uint8_t                        Reserved1[0x0C];
        hmatrix2_prs_registers_t       PRS[HMATRIX2_PRS_NUMBER]; /**< Offset: 0x80  */
  __I   uint8_t                        Reserved2[0x18];
  __IO  uint32_t                       HMATRIX2_MRCR;      /**< Offset: 0x100 (R/W  32) Master Remap Control */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       HMATRIX2_SFR[13];   /**< Offset: 0x110 (R/W  32) Special Function */
  __I   uint8_t                        Reserved4[0x0C];
  __O   uint32_t                       HMATRIX2_MEIER;     /**< Offset: 0x150 ( /W  32) Master Error Interrupt Enable */
  __O   uint32_t                       HMATRIX2_MEIDR;     /**< Offset: 0x154 ( /W  32) Master Error Interrupt Disable */
  __I   uint32_t                       HMATRIX2_MEIMR;     /**< Offset: 0x158 (R/   32) Master Error Interrupt Mask */
  __I   uint32_t                       HMATRIX2_MESR;      /**< Offset: 0x15C (R/   32) Master Error Status */
  __I   uint32_t                       HMATRIX2_MEAR[16];  /**< Offset: 0x160 (R/   32) Master Error Address */
} hmatrix2_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKSG01_HMATRIX2_COMPONENT_H_ */
